InformationRegisters/SM_ПроблемныеКлиентыСогласованиеИсключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SM_ПроблемныеКлиентыСогласованиеИсключений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/SM_ПроблемныеКлиентыСогласованиеИсключений/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Документ,УникальныйИдентификатор,Состояние = Ложь,Причина = "") Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ					= Документ;
	МенеджерЗаписи.УникальныйИдентификатор	= УникальныйИдентификатор;
	
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Документ					= Документ;
		МенеджерЗаписи.УникальныйИдентификатор	= УникальныйИдентификатор;
		МенеджерЗаписи.Состояние				= Состояние;
		МенеджерЗаписи.Причина					= Причина;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры
